; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 9493)
	(= (fuel plane1) 2304)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city2)
	(= (capacity plane2) 13084)
	(= (fuel plane2) 3087)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 12)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city1)
	(= (capacity plane3) 8788)
	(= (fuel plane3) 3426)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 9)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city2)
	(= (capacity plane4) 13638)
	(= (fuel plane4) 4598)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 15)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 2)
	(at plane5 city1)
	(= (capacity plane5) 10641)
	(= (fuel plane5) 1926)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 18)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 3)
	(at person1 city2)
	(at person2 city0)
	(at person3 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 645)
	(= (distance city0 city2) 663)
	(= (distance city1 city0) 645)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 614)
	(= (distance city2 city0) 663)
	(= (distance city2 city1) 614)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane5 city0)
	(at person1 city1)
	(at person2 city2)
	(at person3 city1)
	))

(:metric minimize (+ (* 2 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (board person1 plane4 city2)
   deleted: (at person1 city2)
   added: (in person1 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 2 of 5
2. (refuel plane5 city1)
   changed: (fuel plane5) from 1926 to 10641
   goals met: 2 of 5
3. (fly plane5 city1 city0)
   deleted: (at plane5 city1)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 0 to 3225, (fuel plane5) from 10641 to 7416
   goals met: 3 of 5
4. (fly plane4 city2 city1)
   deleted: (at plane4 city2)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 3225 to 6295, (fuel plane4) from 4598 to 1528
   goals met: 3 of 5
5. (debark person1 plane4 city1)
   deleted: (in person1 plane4)
   added: (at person1 city1)
   changed: (onboard plane4) from 1 to 0
   goals met: 4 of 5
6. (board person2 plane5 city0)
   deleted: (at person2 city0)
   added: (in person2 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 4 of 5
7. (fly plane5 city0 city2)
   deleted: (at plane5 city0)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 6295 to 9610, (fuel plane5) from 7416 to 4101
   goals met: 3 of 5
8. (debark person2 plane5 city2)
   deleted: (in person2 plane5)
   added: (at person2 city2)
   changed: (onboard plane5) from 1 to 0
   goals met: 4 of 5
9. (fly plane5 city2 city0)
   deleted: (at plane5 city2)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 9610 to 12925, (fuel plane5) from 4101 to 786
   goals met: 5 of 5
